Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://prudhviraj2006.github.io/smart-sales-forecaster/"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 Concurrent Virtual Users)"
  plugins:
    expect: {}

scenarios:
  - name: "Health Check and API Navigation"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
