Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up load to 100 VUs"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check & Root Endpoint Performance"
    flow:
      - get:
          url: "/health"
      - get:
          url: "/"
